Tekla.Structures.Model.RebarGuideline
Defines a rebar guideline that is used in a Tekla.Structures.Model.RebarSet.
A Tekla.Structures.Model.RebarSet has a minimum of one rebar guideline, the primary guideline.

Tekla.Structures.Model.RebarGuideline.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarGuideline class.

Tekla.Structures.Model.RebarGuideline.Id
Gets or sets an identifier that may be used to identify instances of the same rebar guideline.

Tekla.Structures.Model.RebarGuideline.Curve
Gets or sets the geometric Tekla.Structures.Model.Contour of the rebar guideline.

Tekla.Structures.Model.RebarGuideline.Spacing
Gets or sets the Tekla.Structures.Model.RebarSpacing along the rebar guideline.

Tekla.Structures.Model.RebarGuideline.FollowEdges
Gets or sets a flag that indicates whether the guideline should attempt to follow
the leg face edges located between its end points.

Tekla.Structures.Model.RebarGuideline.ChamferType
Gets or sets the chamfer type of the guideline.
To create longitudinal bars on the top/bottom face of a flat polybeam, create a guideline at each corner,
and use the ARC_POINT chamfer type at "curved" corners, and NONE otherwise.